<a href="https://colab.research.google.com/github/kamalchibrani-ai/assignment6_ineuron/blob/master/assignment6_data_cleaning_using_pandas_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"





---


### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [ ]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [ ]:
df['FlightNumber'] = range(1045,1095,10)
df['FlightNumber']

0    1045
1    1055
2    1065
3    1075
4    1085
Name: FlightNumber, dtype: int64



---


###2 , 3 , 4. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [ ]:
df['From_To']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [ ]:
temp_data = pd.DataFrame(df['From_To'].str.split('_').to_list(),columns=['From','To'])

In [ ]:
temp_data

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [ ]:
temp_data['From'] = temp_data['From'].str.capitalize()
temp_data['To'] = temp_data['To'].str.capitalize()

In [ ]:
temp_data

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [ ]:
df.drop('From_To' , axis=1 , inplace=True)

In [ ]:
df = pd.concat([temp_data , df] , axis=1 , )

In [ ]:
df = pd.concat([df,temp] , axis=1)

In [ ]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris          1045      [23, 47]               KLM(!)
1    Madrid      Milan          1055            []    <Air France> (12)
2    London  Stockholm          1065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris          1075          [13]       12. Air France
4  Brussels     London          1085      [67, 32]          "Swiss Air"



---



###3.In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. 
###Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [ ]:
delays = pd.DataFrame(df['RecentDelays'].to_list() , columns=['delay_1','delay_2','delay_3']) 
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [ ]:
df.drop(['RecentDelays'] , axis=1 , inplace=True)
df

       From         To  FlightNumber              Airline
0    London      Paris          1045               KLM(!)
1    Madrid      Milan          1055    <Air France> (12)
2    London  Stockholm          1065  (British Airways. )
3  Budapest      Paris          1075       12. Air France
4  Brussels     London          1085          "Swiss Air"

In [ ]:
df = pd.concat([df , delays] ,axis=1)
df

       From         To  FlightNumber  ... delay_1  delay_2  delay_3
0    London      Paris          1045  ...    23.0     47.0      NaN
1    Madrid      Milan          1055  ...     NaN      NaN      NaN
2    London  Stockholm          1065  ...    24.0     43.0     87.0
3  Budapest      Paris          1075  ...    13.0      NaN      NaN
4  Brussels     London          1085  ...    67.0     32.0      NaN

[5 rows x 7 columns]

#final

In [ ]:
df

       From         To  FlightNumber  ... delay_1  delay_2  delay_3
0    London      Paris          1045  ...    23.0     47.0      NaN
1    Madrid      Milan          1055  ...     NaN      NaN      NaN
2    London  Stockholm          1065  ...    24.0     43.0     87.0
3  Budapest      Paris          1075  ...    13.0      NaN      NaN
4  Brussels     London          1085  ...    67.0     32.0      NaN

[5 rows x 7 columns]